app/controllers/books_controller.rb

	def index
		if params[:category].blank?
			@books = Book.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@books = Book.where(:category_id => @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at_DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Romance"]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ?  ORDER BY created_at DESC  [["category_id", 4]]

	def show
		if @book.reviews.blank?
			@average_review = 0
		else
			@average_review = @book.reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 6]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 5]]

	def new
		@book = current_user.books.build
		@categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

	def create
		@book = current_user.books.build(book_params)
		@book.category_id = params[:category_id]

		if @book.save
---
INSERT INTO "books" ("title", "description", "author", "book_img_file_name", "book_img_content_type", "book_img_file_size", "book_img_updated_at", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

	def update
		@book.category_id = params[:category_id]
		if @book.update(book_params)
---
UPDATE "books" SET "book_img_file_name" = ?, "book_img_content_type" = ?, "book_img_file_size" = ?, "book_img_updated_at" = ?, "updated_at" = ? WHERE "books"."id" = ?

		def find_book
			@book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 4]]